app/Controllers/Home.php

    public function index()
    {
        $device = new FingerDeviceModel();

        $data['devices'] = $device->findAll();
---
SELECT *
FROM `device`